tap "cue-lang/tap"
tap "derailed/k9s"
tap "fairwindsops/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kcl-lang/tap"
tap "koekeishiya/formulae"
tap "kong/deck"
tap "kreuzwerker/taps"
tap "leg100/tap"
tap "siderolabs/tap"
tap "stefanprodan/tap"
# Run your GitHub Actions locally
brew "act", args: ["HEAD"]
# GNU compiler collection
brew "gcc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# AI pair programming in your terminal
brew "aider"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Isolated development environments using Docker
brew "docker-compose"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and Lightweight Logs and Metrics processor
brew "fluent-bit"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for glamorous shell scripts
brew "gum"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Improved top (interactive process viewer)
brew "htop"
# Cost estimates for Terraform
brew "infracost"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Istio configuration command-line utility
brew "istioctl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Scanning your k8s clusters, diagnosing, and triaging issues in simple English
brew "k8sgpt"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Run local Kubernetes cluster in Docker
brew "kind"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Simple terminal UI for git commands
brew "lazygit"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Next-gen compiler infrastructure
brew "llvm"
# Run a Kubernetes cluster locally
brew "minikube"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Compile a Node.js project into a single file
brew "ncc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# SDK for building Kubernetes applications
brew "operator-sdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Kubernetes cluster resource sanitizer
brew "popeye"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@12"
# Object-relational database system
brew "postgresql@16"
# Drive terraform at terminal velocity
brew "pug"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Python implementation of Markdown
brew "python-markdown"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Editor of encrypted files
brew "sops"
# Source-code syntax highlighter
brew "source-highlight"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Terminal UI for tshark, inspired by Wireshark
brew "termshark"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Terminal multiplexer
brew "tmux"
# CPU, RAM memory, and load monitor for use with tmux
brew "tmux-mem-cpu-load"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# CUE is an open source data constraint language which aims to simplify tasks involving defining and using data.
brew "cue-lang/tap/cue"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Detect deprecated Kubernetes apiVersions
brew "fairwindsops/tap/pluto"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# KCL Command Line Interface
brew "kcl-lang/tap/kcl"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# CLI to support with downloading and compiling terraform providers for Mac with M1 chip.
brew "kreuzwerker/taps/m1-terraform-provider-helper"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# GPU-accelerated terminal emulator
cask "alacritty"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Terminal-based AI coding assistant
cask "claude-code"
# Column-oriented database management system
cask "clickhouse"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Password manager application and digital vault
cask "keeper-password-manager"
# Discover, download, and run local LLMs
cask "lm-studio"
# Native chat application for all major LLM APIs
cask "macai"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
go "sigs.k8s.io/cloud-provider-kind"
